---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblemWarn
source: html/0f211cc8-9e89-9e6b-0420-542c1964f886.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblemWarn Property

Dormer Opening Cut is not fully defined. Cut was not performed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DormerCutProblemWarn { get; }
```